---
kind: type
id: T:Autodesk.Revit.DB.GeomCombinationSet
source: html/854ed2aa-bd22-3352-383f-7a5230f154e5.htm
---
# Autodesk.Revit.DB.GeomCombinationSet

A set that contains GeomCombination objects.

## Syntax (C#)
```csharp
public class GeomCombinationSet : APIObject,
	IEnumerable
```